In [2]:
import numpy as np 

import pandas as pd

In [15]:
# df = pd.read_csv("C:\\Users\\saurabh\\Desktop\\pyth\\messages.csv")
df = pd.read_csv("C:\\Users\\Shree com\\Desktop\\Data\\ecommerce_data.csv")

In [16]:
df.head(3)

         date  product_id  city_id  orders
0  2019-12-16        1897       26       2
1  2019-12-16        4850       26       4
2  2019-12-16        2466       26       1

In [17]:
df2.head(3)

         date  product_id  city_id  orders
0  2019-12-16        1897       26       2
1  2019-12-16        4850       26       4
2  2019-12-16        2466       26       1

In [18]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 523684 entries, 0 to 523683
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        523684 non-null  object
 1   product_id  523684 non-null  int64
 2   city_id     523684 non-null  int64
 3   orders      523684 non-null  int64
dtypes: int64(3), object(1)
memory usage: 16.0+ MB

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 523684 entries, 0 to 523683
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        523684 non-null  object
 1   product_id  523684 non-null  int64
 2   city_id     523684 non-null  int64
 3   orders      523684 non-null  int64
dtypes: int64(3), object(1)
memory usage: 16.0+ MB

# Working with Dates

In [20]:
# converting to datetime datatype  

df2['date'] = pd.to_datetime(df2['date'])

In [21]:
df2['date']

0        2019-12-16
1        2019-12-16
2        2019-12-16
3        2019-12-16
4        2019-12-16
            ...
523679   2019-01-02
523680   2019-01-04
523681   2019-01-08
523682   2019-01-09
523683   2019-01-10
Name: date, Length: 523684, dtype: datetime64[ns]

In [22]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 523684 entries, 0 to 523683
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   date        523684 non-null  datetime64[ns]
 1   product_id  523684 non-null  int64
 2   city_id     523684 non-null  int64
 3   orders      523684 non-null  int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 16.0 MB

# 1. Extract Year

In [23]:
df2['date_year'] = df2['date'].dt.year

In [24]:
df2['date_year']

0         2019
1         2019
2         2019
3         2019
4         2019
          ...
523679    2019
523680    2019
523681    2019
523682    2019
523683    2019
Name: date_year, Length: 523684, dtype: int64

In [25]:
df2.sample(4)

             date  product_id  city_id  orders  date_year
61076  2019-05-15        6671       20      28       2019
226862 2019-04-09          21       24       1       2019
261102 2019-11-14         147       23       1       2019
371685 2019-06-26        7541       18       2       2019

# 2 . Extract Month

In [26]:
df2['date_month'] = df2['date'].dt.month

In [27]:
df2.sample(4)

             date  product_id  city_id  orders  date_year  date_month
223645 2019-02-23        2196       18       3       2019           2
193529 2019-03-09        2324        9      13       2019           3
343008 2019-06-08          83       25       1       2019           6
181377 2019-01-14         901       23      10       2019           1

# 3 . Month Name

In [28]:
df2['date_month_name'] = df2['date'].dt.month_name()

In [29]:
df2.sample(4)

,date,product_id,city_id,orders,date_year,date_month,date_month_name
303853,2019-06-10,3432,13,20,2019,6,June
8328,2019-10-08,7028,26,12,2019,10,October
519338,2018-10-22,435,7,2,2018,10,October
210597,2019-02-13,3757,16,4,2019,2,February

# 4 . Extract days

In [30]:
df2['date_days'] = df2['date'].dt.day

In [31]:
df2.sample(4)

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days
294960,2019-06-30,2008,26,2,2019,6,June,30
172103,2019-02-23,1345,13,11,2019,2,February,23
443016,2018-11-22,6461,14,1,2018,11,November,22
79587,2019-11-23,6543,9,6,2019,11,November,23

# 5 . dayofweek

In [32]:
df2['date_dayofweek'] = df2['date'].dt.dayofweek

In [33]:
df2.sample(4)

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days,date_dayofweek
245267,2019-02-22,2031,29,1,2019,2,February,22,4
220634,2019-01-24,4305,22,11,2019,1,January,24,3
269142,2019-11-07,867,10,5,2019,11,November,7,3
235322,2019-03-22,4436,17,50,2019,3,March,22,4

# 6 . day name

In [34]:
df2['date_day'] = df2['date'].dt.day_name()

In [35]:
df2.sample(4)

,date,product_id,city_id,orders,date_year,date_month,date_month_name,date_days,date_dayofweek,date_day
92459,2019-12-02,60,24,42,2019,12,December,2,0,Monday
312543,2019-07-07,1954,13,3,2019,7,July,7,6,Sunday
414965,2018-10-25,3520,2,9,2018,10,October,25,3,Thursday
255611,2019-11-12,5917,2,46,2019,11,November,12,1,Tuesday

# is weekend

In [36]:
df2['date_is_weekend'] = np.where(df2['date_day'].isin(['Sunday' , 'Saturday']) , 1,0)

df2.drop(columns = ['product_id' , 'city_id' , 'orders']).head()

,date,date_year,date_month,date_month_name,date_days,date_dayofweek,date_day,date_is_weekend
0,2019-12-16,2019,12,December,16,0,Monday,0
1,2019-12-16,2019,12,December,16,0,Monday,0
2,2019-12-16,2019,12,December,16,0,Monday,0
3,2019-12-16,2019,12,December,16,0,Monday,0
4,2019-12-16,2019,12,December,16,0,Monday,0

In [ ]:
df2.sample(8)

# Extract weak of the year

In [ ]:
df2['date_week'] = df2['date'].dt.week 
df2.drop(columns = ['product_id',  'city_id' , 'orders']).head()

In [ ]:
df2.sample(8)

In [ ]:
df2['quarter'] = df2['date'].dt.quarter 

df2.drop(columns = ['product_id' , 'city_id' , 'orders']).head(2)

In [ ]:
df2.head(2)

# Extract time elapsed between dates

In [ ]:
import datetime 

today = datetime.datetime.today() 

today

In [ ]:
today - df2['date']

In [ ]:
(today - df2['date']).dt.days

In [ ]:
# Months passed

np.round((today -df2['date']) / np.timedelta64(1, 'M'),0)

In [ ]:
df.info()

In [ ]:
# converting to datetime datatype  
df['date'] = pd.to_datetime(df['date'])

In [ ]:
df.head(2)

In [ ]:
df.info()

In [ ]:
df['hour'] = df['date'].dt.hour 
df['minute'] = df['date'].dt.minute
df['second'] = df['date'].dt.second

In [ ]:
df.head(4)

# Extract time part

In [ ]:
df['time'] = df['date'].dt.time

In [ ]:
df.sample(3)